Revit 2026 API

# ElectricalSystemDisconnectPanel Method

---

Disconnect the panel for the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DisconnectPanel()
```
```vb
Public Sub DisconnectPanel
```
```cpp
public:
void DisconnectPanel()
```
```fsharp
member DisconnectPanel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the panel cannot be disconnected for the electrical system. |

If successful, the system will disconnect this panel. Otherwise the exception will be thrown. This method will only function with the Autodesk Revit MEP application.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace